frankenphp_experiment/benchmarking/results/frankenphp-k6.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /scripts/k6-script.js
        output: -

     scenarios: (100.00%) 1 scenario, 150 max VUs, 5m15s max duration (incl. graceful stop):
              * default: Up to 150 looping VUs for 4m45s over 5 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 002/150 VUs, 1 complete and 0 interrupted iterations
default   [   0% ] 002/150 VUs  0m01.0s/4m45.0s

running (0m02.0s), 004/150 VUs, 5 complete and 0 interrupted iterations
default   [   1% ] 004/150 VUs  0m02.0s/4m45.0s

running (0m03.0s), 005/150 VUs, 13 complete and 0 interrupted iterations
default   [   1% ] 005/150 VUs  0m03.0s/4m45.0s

running (0m04.0s), 007/150 VUs, 24 complete and 0 interrupted iterations
default   [   1% ] 007/150 VUs  0m04.0s/4m45.0s

running (0m05.0s), 009/150 VUs, 36 complete and 0 interrupted iterations
default   [   2% ] 009/150 VUs  0m05.0s/4m45.0s

running (0m06.0s), 010/150 VUs, 54 complete and 0 interrupted iterations
default   [   2% ] 010/150 VUs  0m06.0s/4m45.0s

running (0m07.0s), 012/150 VUs, 74 complete and 0 interrupted iterations
default   [   2% ] 012/150 VUs  0m07.0s/4m45.0s

running (0m08.0s), 013/150 VUs, 97 complete and 0 interrupted iterations
default   [   3% ] 013/150 VUs  0m08.0s/4m45.0s

running (0m09.0s), 015/150 VUs, 124 complete and 0 interrupted iterations
default   [   3% ] 015/150 VUs  0m09.0s/4m45.0s

running (0m10.0s), 017/150 VUs, 152 complete and 0 interrupted iterations
default   [   3% ] 017/150 VUs  0m10.0s/4m45.0s

running (0m11.0s), 018/150 VUs, 182 complete and 0 interrupted iterations
default   [   4% ] 018/150 VUs  0m11.0s/4m45.0s

running (0m12.0s), 020/150 VUs, 218 complete and 0 interrupted iterations
default   [   4% ] 020/150 VUs  0m12.0s/4m45.0s

running (0m13.0s), 022/150 VUs, 250 complete and 0 interrupted iterations
default   [   5% ] 022/150 VUs  0m13.0s/4m45.0s

running (0m14.0s), 023/150 VUs, 294 complete and 0 interrupted iterations
default   [   5% ] 023/150 VUs  0m14.0s/4m45.0s

running (0m15.0s), 025/150 VUs, 340 complete and 0 interrupted iterations
default   [   5% ] 025/150 VUs  0m15.0s/4m45.0s

running (0m16.0s), 027/150 VUs, 391 complete and 0 interrupted iterations
default   [   6% ] 027/150 VUs  0m16.0s/4m45.0s

running (0m17.0s), 028/150 VUs, 433 complete and 0 interrupted iterations
default   [   6% ] 028/150 VUs  0m17.0s/4m45.0s

running (0m18.0s), 030/150 VUs, 490 complete and 0 interrupted iterations
default   [   6% ] 030/150 VUs  0m18.0s/4m45.0s

running (0m19.0s), 031/150 VUs, 541 complete and 0 interrupted iterations
default   [   7% ] 031/150 VUs  0m19.0s/4m45.0s

running (0m20.0s), 033/150 VUs, 602 complete and 0 interrupted iterations
default   [   7% ] 033/150 VUs  0m20.0s/4m45.0s

running (0m21.0s), 035/150 VUs, 668 complete and 0 interrupted iterations
default   [   7% ] 035/150 VUs  0m21.0s/4m45.0s

running (0m22.0s), 036/150 VUs, 736 complete and 0 interrupted iterations
default   [   8% ] 036/150 VUs  0m22.0s/4m45.0s

running (0m23.0s), 038/150 VUs, 809 complete and 0 interrupted iterations
default   [   8% ] 038/150 VUs  0m23.0s/4m45.0s

running (0m24.0s), 040/150 VUs, 868 complete and 0 interrupted iterations
default   [   8% ] 040/150 VUs  0m24.0s/4m45.0s

running (0m25.0s), 041/150 VUs, 948 complete and 0 interrupted iterations
default   [   9% ] 041/150 VUs  0m25.0s/4m45.0s

running (0m26.0s), 043/150 VUs, 1030 complete and 0 interrupted iterations
default   [   9% ] 043/150 VUs  0m26.0s/4m45.0s

running (0m27.0s), 045/150 VUs, 1106 complete and 0 interrupted iterations
default   [   9% ] 045/150 VUs  0m27.0s/4m45.0s

running (0m28.0s), 046/150 VUs, 1190 complete and 0 interrupted iterations
default   [  10% ] 046/150 VUs  0m28.0s/4m45.0s

running (0m29.0s), 048/150 VUs, 1283 complete and 0 interrupted iterations
default   [  10% ] 048/150 VUs  0m29.0s/4m45.0s

running (0m30.0s), 049/150 VUs, 1370 complete and 0 interrupted iterations
default   [  11% ] 049/150 VUs  0m30.0s/4m45.0s

running (0m31.0s), 050/150 VUs, 1452 complete and 0 interrupted iterations
default   [  11% ] 050/150 VUs  0m31.0s/4m45.0s

running (0m32.0s), 051/150 VUs, 1553 complete and 0 interrupted iterations
default   [  11% ] 051/150 VUs  0m32.0s/4m45.0s

running (0m33.0s), 052/150 VUs, 1655 complete and 0 interrupted iterations
default   [  12% ] 052/150 VUs  0m33.0s/4m45.0s

running (0m34.0s), 053/150 VUs, 1751 complete and 0 interrupted iterations
default   [  12% ] 053/150 VUs  0m34.0s/4m45.0s

running (0m35.0s), 054/150 VUs, 1852 complete and 0 interrupted iterations
default   [  12% ] 054/150 VUs  0m35.0s/4m45.0s

running (0m36.0s), 054/150 VUs, 1950 complete and 0 interrupted iterations
default   [  13% ] 054/150 VUs  0m36.0s/4m45.0s

running (0m37.0s), 055/150 VUs, 2059 complete and 0 interrupted iterations
default   [  13% ] 055/150 VUs  0m37.0s/4m45.0s

running (0m38.0s), 056/150 VUs, 2160 complete and 0 interrupted iterations
default   [  13% ] 056/150 VUs  0m38.0s/4m45.0s

running (0m39.0s), 057/150 VUs, 2260 complete and 0 interrupted iterations
default   [  14% ] 057/150 VUs  0m39.0s/4m45.0s

running (0m40.0s), 058/150 VUs, 2366 complete and 0 interrupted iterations
default   [  14% ] 058/150 VUs  0m40.0s/4m45.0s

running (0m41.0s), 059/150 VUs, 2460 complete and 0 interrupted iterations
default   [  14% ] 059/150 VUs  0m41.0s/4m45.0s

running (0m42.0s), 059/150 VUs, 2574 complete and 0 interrupted iterations
default   [  15% ] 059/150 VUs  0m42.0s/4m45.0s

running (0m43.0s), 060/150 VUs, 2693 complete and 0 interrupted iterations
default   [  15% ] 060/150 VUs  0m43.0s/4m45.0s

running (0m44.0s), 061/150 VUs, 2813 complete and 0 interrupted iterations
default   [  15% ] 061/150 VUs  0m44.0s/4m45.0s

running (0m45.0s), 062/150 VUs, 2936 complete and 0 interrupted iterations
default   [  16% ] 062/150 VUs  0m45.0s/4m45.0s

running (0m46.0s), 063/150 VUs, 3044 complete and 0 interrupted iterations
default   [  16% ] 063/150 VUs  0m46.0s/4m45.0s

running (0m47.0s), 064/150 VUs, 3150 complete and 0 interrupted iterations
default   [  16% ] 064/150 VUs  0m47.0s/4m45.0s

running (0m48.0s), 064/150 VUs, 3261 complete and 0 interrupted iterations
default   [  17% ] 064/150 VUs  0m48.0s/4m45.0s

running (0m49.0s), 065/150 VUs, 3383 complete and 0 interrupted iterations
default   [  17% ] 065/150 VUs  0m49.0s/4m45.0s

running (0m50.0s), 066/150 VUs, 3514 complete and 0 interrupted iterations
default   [  18% ] 066/150 VUs  0m50.0s/4m45.0s

running (0m51.0s), 067/150 VUs, 3638 complete and 0 interrupted iterations
default   [  18% ] 067/150 VUs  0m51.0s/4m45.0s

running (0m52.0s), 068/150 VUs, 3767 complete and 0 interrupted iterations
default   [  18% ] 068/150 VUs  0m52.0s/4m45.0s

running (0m53.0s), 069/150 VUs, 3893 complete and 0 interrupted iterations
default   [  19% ] 069/150 VUs  0m53.0s/4m45.0s

running (0m54.0s), 069/150 VUs, 4024 complete and 0 interrupted iterations
default   [  19% ] 069/150 VUs  0m54.0s/4m45.0s

running (0m55.0s), 070/150 VUs, 4156 complete and 0 interrupted iterations
default   [  19% ] 070/150 VUs  0m55.0s/4m45.0s

running (0m56.0s), 071/150 VUs, 4286 complete and 0 interrupted iterations
default   [  20% ] 071/150 VUs  0m56.0s/4m45.0s

running (0m57.0s), 072/150 VUs, 4421 complete and 0 interrupted iterations
default   [  20% ] 072/150 VUs  0m57.0s/4m45.0s

running (0m58.0s), 073/150 VUs, 4544 complete and 0 interrupted iterations
default   [  20% ] 073/150 VUs  0m58.0s/4m45.0s

running (0m59.0s), 074/150 VUs, 4689 complete and 0 interrupted iterations
default   [  21% ] 074/150 VUs  0m59.0s/4m45.0s

running (1m00.0s), 074/150 VUs, 4837 complete and 0 interrupted iterations
default   [  21% ] 074/150 VUs  1m00.0s/4m45.0s

running (1m01.0s), 075/150 VUs, 4979 complete and 0 interrupted iterations
default   [  21% ] 075/150 VUs  1m01.0s/4m45.0s

running (1m02.0s), 076/150 VUs, 5122 complete and 0 interrupted iterations
default   [  22% ] 076/150 VUs  1m02.0s/4m45.0s

running (1m03.0s), 077/150 VUs, 5247 complete and 0 interrupted iterations
default   [  22% ] 077/150 VUs  1m03.0s/4m45.0s

running (1m04.0s), 078/150 VUs, 5368 complete and 0 interrupted iterations
default   [  22% ] 078/150 VUs  1m04.0s/4m45.0s

running (1m05.0s), 079/150 VUs, 5524 complete and 0 interrupted iterations
default   [  23% ] 079/150 VUs  1m05.0s/4m45.0s

running (1m06.0s), 079/150 VUs, 5682 complete and 0 interrupted iterations
default   [  23% ] 079/150 VUs  1m06.0s/4m45.0s

running (1m07.0s), 080/150 VUs, 5815 complete and 0 interrupted iterations
default   [  23% ] 080/150 VUs  1m07.0s/4m45.0s

running (1m08.0s), 081/150 VUs, 5951 complete and 0 interrupted iterations
default   [  24% ] 081/150 VUs  1m08.0s/4m45.0s

running (1m09.0s), 082/150 VUs, 6086 complete and 0 interrupted iterations
default   [  24% ] 082/150 VUs  1m09.0s/4m45.0s

running (1m10.0s), 083/150 VUs, 6249 complete and 0 interrupted iterations
default   [  25% ] 083/150 VUs  1m10.0s/4m45.0s

running (1m11.0s), 084/150 VUs, 6391 complete and 0 interrupted iterations
default   [  25% ] 084/150 VUs  1m11.0s/4m45.0s

running (1m12.0s), 084/150 VUs, 6539 complete and 0 interrupted iterations
default   [  25% ] 084/150 VUs  1m12.0s/4m45.0s

running (1m13.0s), 085/150 VUs, 6690 complete and 0 interrupted iterations
default   [  26% ] 085/150 VUs  1m13.0s/4m45.0s

running (1m14.0s), 086/150 VUs, 6853 complete and 0 interrupted iterations
default   [  26% ] 086/150 VUs  1m14.0s/4m45.0s

running (1m15.0s), 087/150 VUs, 7022 complete and 0 interrupted iterations
default   [  26% ] 087/150 VUs  1m15.0s/4m45.0s

running (1m16.0s), 088/150 VUs, 7192 complete and 0 interrupted iterations
default   [  27% ] 088/150 VUs  1m16.0s/4m45.0s

running (1m17.0s), 089/150 VUs, 7358 complete and 0 interrupted iterations
default   [  27% ] 089/150 VUs  1m17.0s/4m45.0s

running (1m18.0s), 089/150 VUs, 7513 complete and 0 interrupted iterations
default   [  27% ] 089/150 VUs  1m18.0s/4m45.0s

running (1m19.0s), 090/150 VUs, 7681 complete and 0 interrupted iterations
default   [  28% ] 090/150 VUs  1m19.0s/4m45.0s

running (1m20.0s), 091/150 VUs, 7850 complete and 0 interrupted iterations
default   [  28% ] 091/150 VUs  1m20.0s/4m45.0s

running (1m21.0s), 092/150 VUs, 8019 complete and 0 interrupted iterations
default   [  28% ] 092/150 VUs  1m21.0s/4m45.0s

running (1m22.0s), 093/150 VUs, 8191 complete and 0 interrupted iterations
default   [  29% ] 093/150 VUs  1m22.0s/4m45.0s

running (1m23.0s), 094/150 VUs, 8377 complete and 0 interrupted iterations
default   [  29% ] 094/150 VUs  1m23.0s/4m45.0s

running (1m24.0s), 094/150 VUs, 8552 complete and 0 interrupted iterations
default   [  29% ] 094/150 VUs  1m24.0s/4m45.0s

running (1m25.0s), 095/150 VUs, 8731 complete and 0 interrupted iterations
default   [  30% ] 095/150 VUs  1m25.0s/4m45.0s

running (1m26.0s), 096/150 VUs, 8906 complete and 0 interrupted iterations
default   [  30% ] 096/150 VUs  1m26.0s/4m45.0s

running (1m27.0s), 097/150 VUs, 9079 complete and 0 interrupted iterations
default   [  31% ] 097/150 VUs  1m27.0s/4m45.0s

running (1m28.0s), 098/150 VUs, 9246 complete and 0 interrupted iterations
default   [  31% ] 098/150 VUs  1m28.0s/4m45.0s

running (1m29.0s), 099/150 VUs, 9432 complete and 0 interrupted iterations
default   [  31% ] 099/150 VUs  1m29.0s/4m45.0s

running (1m30.0s), 099/150 VUs, 9630 complete and 0 interrupted iterations
default   [  32% ] 099/150 VUs  1m30.0s/4m45.0s

running (1m31.0s), 100/150 VUs, 9802 complete and 0 interrupted iterations
default   [  32% ] 100/150 VUs  1m31.0s/4m45.0s

running (1m32.0s), 101/150 VUs, 9971 complete and 0 interrupted iterations
default   [  32% ] 101/150 VUs  1m32.0s/4m45.0s

running (1m33.0s), 101/150 VUs, 10150 complete and 0 interrupted iterations
default   [  33% ] 101/150 VUs  1m33.0s/4m45.0s

running (1m34.0s), 102/150 VUs, 10338 complete and 0 interrupted iterations
default   [  33% ] 102/150 VUs  1m34.0s/4m45.0s

running (1m35.0s), 102/150 VUs, 10537 complete and 0 interrupted iterations
default   [  33% ] 102/150 VUs  1m35.0s/4m45.0s

running (1m36.0s), 103/150 VUs, 10726 complete and 0 interrupted iterations
default   [  34% ] 103/150 VUs  1m36.0s/4m45.0s

running (1m37.0s), 103/150 VUs, 10921 complete and 0 interrupted iterations
default   [  34% ] 103/150 VUs  1m37.0s/4m45.0s

running (1m38.0s), 104/150 VUs, 11114 complete and 0 interrupted iterations
default   [  34% ] 104/150 VUs  1m38.0s/4m45.0s

running (1m39.0s), 104/150 VUs, 11312 complete and 0 interrupted iterations
default   [  35% ] 104/150 VUs  1m39.0s/4m45.0s

running (1m40.0s), 105/150 VUs, 11514 complete and 0 interrupted iterations
default   [  35% ] 105/150 VUs  1m40.0s/4m45.0s

running (1m41.0s), 106/150 VUs, 11709 complete and 0 interrupted iterations
default   [  35% ] 106/150 VUs  1m41.0s/4m45.0s

running (1m42.0s), 106/150 VUs, 11907 complete and 0 interrupted iterations
default   [  36% ] 106/150 VUs  1m42.0s/4m45.0s

running (1m43.0s), 107/150 VUs, 12105 complete and 0 interrupted iterations
default   [  36% ] 107/150 VUs  1m43.0s/4m45.0s

running (1m44.0s), 107/150 VUs, 12311 complete and 0 interrupted iterations
default   [  36% ] 107/150 VUs  1m44.0s/4m45.0s

running (1m45.0s), 108/150 VUs, 12511 complete and 0 interrupted iterations
default   [  37% ] 108/150 VUs  1m45.0s/4m45.0s

running (1m46.0s), 108/150 VUs, 12717 complete and 0 interrupted iterations
default   [  37% ] 108/150 VUs  1m46.0s/4m45.0s

running (1m47.0s), 109/150 VUs, 12861 complete and 0 interrupted iterations
default   [  38% ] 109/150 VUs  1m47.0s/4m45.0s

running (1m48.0s), 109/150 VUs, 13049 complete and 0 interrupted iterations
default   [  38% ] 109/150 VUs  1m48.0s/4m45.0s

running (1m49.0s), 110/150 VUs, 13260 complete and 0 interrupted iterations
default   [  38% ] 110/150 VUs  1m49.0s/4m45.0s

running (1m50.0s), 111/150 VUs, 13459 complete and 0 interrupted iterations
default   [  39% ] 111/150 VUs  1m50.0s/4m45.0s

running (1m51.0s), 111/150 VUs, 13673 complete and 0 interrupted iterations
default   [  39% ] 111/150 VUs  1m51.0s/4m45.0s

running (1m52.0s), 112/150 VUs, 13875 complete and 0 interrupted iterations
default   [  39% ] 112/150 VUs  1m52.0s/4m45.0s

running (1m53.0s), 112/150 VUs, 14089 complete and 0 interrupted iterations
default   [  40% ] 112/150 VUs  1m53.0s/4m45.0s

running (1m54.0s), 113/150 VUs, 14305 complete and 0 interrupted iterations
default   [  40% ] 113/150 VUs  1m54.0s/4m45.0s

running (1m55.0s), 113/150 VUs, 14508 complete and 0 interrupted iterations
default   [  40% ] 113/150 VUs  1m55.0s/4m45.0s

running (1m56.0s), 114/150 VUs, 14718 complete and 0 interrupted iterations
default   [  41% ] 114/150 VUs  1m56.0s/4m45.0s

running (1m57.0s), 114/150 VUs, 14934 complete and 0 interrupted iterations
default   [  41% ] 114/150 VUs  1m57.0s/4m45.0s

running (1m58.0s), 115/150 VUs, 15150 complete and 0 interrupted iterations
default   [  41% ] 115/150 VUs  1m58.0s/4m45.0s

running (1m59.0s), 116/150 VUs, 15356 complete and 0 interrupted iterations
default   [  42% ] 116/150 VUs  1m59.0s/4m45.0s

running (2m00.0s), 116/150 VUs, 15580 complete and 0 interrupted iterations
default   [  42% ] 116/150 VUs  2m00.0s/4m45.0s

running (2m01.0s), 117/150 VUs, 15796 complete and 0 interrupted iterations
default   [  42% ] 117/150 VUs  2m01.0s/4m45.0s

running (2m02.0s), 117/150 VUs, 16006 complete and 0 interrupted iterations
default   [  43% ] 117/150 VUs  2m02.0s/4m45.0s

running (2m03.0s), 118/150 VUs, 16231 complete and 0 interrupted iterations
default   [  43% ] 118/150 VUs  2m03.0s/4m45.0s

running (2m04.0s), 118/150 VUs, 16454 complete and 0 interrupted iterations
default   [  43% ] 118/150 VUs  2m04.0s/4m45.0s

running (2m05.0s), 119/150 VUs, 16669 complete and 0 interrupted iterations
default   [  44% ] 119/150 VUs  2m05.0s/4m45.0s

running (2m06.0s), 119/150 VUs, 16889 complete and 0 interrupted iterations
default   [  44% ] 119/150 VUs  2m06.0s/4m45.0s

running (2m07.0s), 120/150 VUs, 17113 complete and 0 interrupted iterations
default   [  45% ] 120/150 VUs  2m07.0s/4m45.0s

running (2m08.0s), 121/150 VUs, 17327 complete and 0 interrupted iterations
default   [  45% ] 121/150 VUs  2m08.0s/4m45.0s

running (2m09.0s), 121/150 VUs, 17550 complete and 0 interrupted iterations
default   [  45% ] 121/150 VUs  2m09.0s/4m45.0s

running (2m10.0s), 122/150 VUs, 17744 complete and 0 interrupted iterations
default   [  46% ] 122/150 VUs  2m10.0s/4m45.0s

running (2m11.0s), 122/150 VUs, 17965 complete and 0 interrupted iterations
default   [  46% ] 122/150 VUs  2m11.0s/4m45.0s

running (2m12.0s), 123/150 VUs, 18190 complete and 0 interrupted iterations
default   [  46% ] 123/150 VUs  2m12.0s/4m45.0s

running (2m13.0s), 123/150 VUs, 18411 complete and 0 interrupted iterations
default   [  47% ] 123/150 VUs  2m13.0s/4m45.0s

running (2m14.0s), 124/150 VUs, 18627 complete and 0 interrupted iterations
default   [  47% ] 124/150 VUs  2m14.0s/4m45.0s

running (2m15.0s), 124/150 VUs, 18854 complete and 0 interrupted iterations
default   [  47% ] 124/150 VUs  2m15.0s/4m45.0s

running (2m16.0s), 125/150 VUs, 19085 complete and 0 interrupted iterations
default   [  48% ] 125/150 VUs  2m16.0s/4m45.0s

running (2m17.0s), 126/150 VUs, 19317 complete and 0 interrupted iterations
default   [  48% ] 126/150 VUs  2m17.0s/4m45.0s

running (2m18.0s), 126/150 VUs, 19546 complete and 0 interrupted iterations
default   [  48% ] 126/150 VUs  2m18.0s/4m45.0s

running (2m19.0s), 127/150 VUs, 19773 complete and 0 interrupted iterations
default   [  49% ] 127/150 VUs  2m19.0s/4m45.0s

running (2m20.0s), 127/150 VUs, 20005 complete and 0 interrupted iterations
default   [  49% ] 127/150 VUs  2m20.0s/4m45.0s

running (2m21.0s), 128/150 VUs, 20250 complete and 0 interrupted iterations
default   [  49% ] 128/150 VUs  2m21.0s/4m45.0s

running (2m22.0s), 128/150 VUs, 20484 complete and 0 interrupted iterations
default   [  50% ] 128/150 VUs  2m22.0s/4m45.0s

running (2m23.0s), 129/150 VUs, 20718 complete and 0 interrupted iterations
default   [  50% ] 129/150 VUs  2m23.0s/4m45.0s

running (2m24.0s), 129/150 VUs, 20953 complete and 0 interrupted iterations
default   [  51% ] 129/150 VUs  2m24.0s/4m45.0s

running (2m25.0s), 130/150 VUs, 21198 complete and 0 interrupted iterations
default   [  51% ] 130/150 VUs  2m25.0s/4m45.0s

running (2m26.0s), 131/150 VUs, 21433 complete and 0 interrupted iterations
default   [  51% ] 131/150 VUs  2m26.0s/4m45.0s

running (2m27.0s), 131/150 VUs, 21674 complete and 0 interrupted iterations
default   [  52% ] 131/150 VUs  2m27.0s/4m45.0s

running (2m28.0s), 132/150 VUs, 21908 complete and 0 interrupted iterations
default   [  52% ] 132/150 VUs  2m28.0s/4m45.0s

running (2m29.0s), 132/150 VUs, 22144 complete and 0 interrupted iterations
default   [  52% ] 132/150 VUs  2m29.0s/4m45.0s

running (2m30.0s), 133/150 VUs, 22389 complete and 0 interrupted iterations
default   [  53% ] 133/150 VUs  2m30.0s/4m45.0s

running (2m31.0s), 133/150 VUs, 22634 complete and 0 interrupted iterations
default   [  53% ] 133/150 VUs  2m31.0s/4m45.0s

running (2m32.0s), 134/150 VUs, 22868 complete and 0 interrupted iterations
default   [  53% ] 134/150 VUs  2m32.0s/4m45.0s

running (2m33.0s), 134/150 VUs, 23119 complete and 0 interrupted iterations
default   [  54% ] 134/150 VUs  2m33.0s/4m45.0s

running (2m34.0s), 135/150 VUs, 23349 complete and 0 interrupted iterations
default   [  54% ] 135/150 VUs  2m34.0s/4m45.0s

running (2m35.0s), 136/150 VUs, 23593 complete and 0 interrupted iterations
default   [  54% ] 136/150 VUs  2m35.0s/4m45.0s

running (2m36.0s), 136/150 VUs, 23841 complete and 0 interrupted iterations
default   [  55% ] 136/150 VUs  2m36.0s/4m45.0s

running (2m37.0s), 137/150 VUs, 24082 complete and 0 interrupted iterations
default   [  55% ] 137/150 VUs  2m37.0s/4m45.0s

running (2m38.0s), 137/150 VUs, 24333 complete and 0 interrupted iterations
default   [  55% ] 137/150 VUs  2m38.0s/4m45.0s

running (2m39.0s), 138/150 VUs, 24575 complete and 0 interrupted iterations
default   [  56% ] 138/150 VUs  2m39.0s/4m45.0s

running (2m40.0s), 138/150 VUs, 24816 complete and 0 interrupted iterations
default   [  56% ] 138/150 VUs  2m40.0s/4m45.0s

running (2m41.0s), 139/150 VUs, 25065 complete and 0 interrupted iterations
default   [  56% ] 139/150 VUs  2m41.0s/4m45.0s

running (2m42.0s), 139/150 VUs, 25319 complete and 0 interrupted iterations
default   [  57% ] 139/150 VUs  2m42.0s/4m45.0s

running (2m43.0s), 140/150 VUs, 25545 complete and 0 interrupted iterations
default   [  57% ] 140/150 VUs  2m43.0s/4m45.0s

running (2m44.0s), 141/150 VUs, 25793 complete and 0 interrupted iterations
default   [  58% ] 141/150 VUs  2m44.0s/4m45.0s

running (2m45.0s), 141/150 VUs, 26038 complete and 0 interrupted iterations
default   [  58% ] 141/150 VUs  2m45.0s/4m45.0s

running (2m46.0s), 142/150 VUs, 26294 complete and 0 interrupted iterations
default   [  58% ] 142/150 VUs  2m46.0s/4m45.0s

running (2m47.0s), 142/150 VUs, 26482 complete and 0 interrupted iterations
default   [  59% ] 142/150 VUs  2m47.0s/4m45.0s

running (2m48.0s), 143/150 VUs, 26720 complete and 0 interrupted iterations
default   [  59% ] 143/150 VUs  2m48.0s/4m45.0s

running (2m49.0s), 143/150 VUs, 26939 complete and 0 interrupted iterations
default   [  59% ] 143/150 VUs  2m49.0s/4m45.0s

running (2m50.0s), 144/150 VUs, 27179 complete and 0 interrupted iterations
default   [  60% ] 144/150 VUs  2m50.0s/4m45.0s

running (2m51.0s), 144/150 VUs, 27415 complete and 0 interrupted iterations
default   [  60% ] 144/150 VUs  2m51.0s/4m45.0s

running (2m52.0s), 145/150 VUs, 27656 complete and 0 interrupted iterations
default   [  60% ] 145/150 VUs  2m52.0s/4m45.0s

running (2m53.0s), 146/150 VUs, 27895 complete and 0 interrupted iterations
default   [  61% ] 146/150 VUs  2m53.0s/4m45.0s

running (2m54.0s), 146/150 VUs, 28135 complete and 0 interrupted iterations
default   [  61% ] 146/150 VUs  2m54.0s/4m45.0s

running (2m55.0s), 147/150 VUs, 28380 complete and 0 interrupted iterations
default   [  61% ] 147/150 VUs  2m55.0s/4m45.0s

running (2m56.0s), 147/150 VUs, 28629 complete and 0 interrupted iterations
default   [  62% ] 147/150 VUs  2m56.0s/4m45.0s

running (2m57.0s), 148/150 VUs, 28880 complete and 0 interrupted iterations
default   [  62% ] 148/150 VUs  2m57.0s/4m45.0s

running (2m58.0s), 148/150 VUs, 29118 complete and 0 interrupted iterations
default   [  62% ] 148/150 VUs  2m58.0s/4m45.0s

running (2m59.0s), 149/150 VUs, 29322 complete and 0 interrupted iterations
default   [  63% ] 149/150 VUs  2m59.0s/4m45.0s

running (3m00.0s), 149/150 VUs, 29554 complete and 0 interrupted iterations
default   [  63% ] 149/150 VUs  3m00.0s/4m45.0s

running (3m01.0s), 150/150 VUs, 29775 complete and 0 interrupted iterations
default   [  63% ] 150/150 VUs  3m01.0s/4m45.0s

running (3m02.0s), 150/150 VUs, 30022 complete and 0 interrupted iterations
default   [  64% ] 150/150 VUs  3m02.0s/4m45.0s

running (3m03.0s), 150/150 VUs, 30268 complete and 0 interrupted iterations
default   [  64% ] 150/150 VUs  3m03.0s/4m45.0s

running (3m04.0s), 150/150 VUs, 30505 complete and 0 interrupted iterations
default   [  65% ] 150/150 VUs  3m04.0s/4m45.0s

running (3m05.0s), 150/150 VUs, 30719 complete and 0 interrupted iterations
default   [  65% ] 150/150 VUs  3m05.0s/4m45.0s

running (3m06.0s), 150/150 VUs, 30963 complete and 0 interrupted iterations
default   [  65% ] 150/150 VUs  3m06.0s/4m45.0s

running (3m07.0s), 150/150 VUs, 31180 complete and 0 interrupted iterations
default   [  66% ] 150/150 VUs  3m07.0s/4m45.0s

running (3m08.0s), 150/150 VUs, 31415 complete and 0 interrupted iterations
default   [  66% ] 150/150 VUs  3m08.0s/4m45.0s

running (3m09.0s), 150/150 VUs, 31650 complete and 0 interrupted iterations
default   [  66% ] 150/150 VUs  3m09.0s/4m45.0s

running (3m10.0s), 150/150 VUs, 31834 complete and 0 interrupted iterations
default   [  67% ] 150/150 VUs  3m10.0s/4m45.0s

running (3m11.0s), 150/150 VUs, 32074 complete and 0 interrupted iterations
default   [  67% ] 150/150 VUs  3m11.0s/4m45.0s

running (3m12.0s), 150/150 VUs, 32322 complete and 0 interrupted iterations
default   [  67% ] 150/150 VUs  3m12.0s/4m45.0s

running (3m13.0s), 150/150 VUs, 32566 complete and 0 interrupted iterations
default   [  68% ] 150/150 VUs  3m13.0s/4m45.0s

running (3m14.0s), 150/150 VUs, 32808 complete and 0 interrupted iterations
default   [  68% ] 150/150 VUs  3m14.0s/4m45.0s

running (3m15.0s), 150/150 VUs, 33049 complete and 0 interrupted iterations
default   [  68% ] 150/150 VUs  3m15.0s/4m45.0s

running (3m16.0s), 150/150 VUs, 33278 complete and 0 interrupted iterations
default   [  69% ] 150/150 VUs  3m16.0s/4m45.0s

running (3m17.0s), 150/150 VUs, 33501 complete and 0 interrupted iterations
default   [  69% ] 150/150 VUs  3m17.0s/4m45.0s

running (3m18.0s), 150/150 VUs, 33732 complete and 0 interrupted iterations
default   [  69% ] 150/150 VUs  3m18.0s/4m45.0s

running (3m19.0s), 150/150 VUs, 33966 complete and 0 interrupted iterations
default   [  70% ] 150/150 VUs  3m19.0s/4m45.0s

running (3m20.0s), 150/150 VUs, 34194 complete and 0 interrupted iterations
default   [  70% ] 150/150 VUs  3m20.0s/4m45.0s

running (3m21.0s), 150/150 VUs, 34430 complete and 0 interrupted iterations
default   [  71% ] 150/150 VUs  3m21.0s/4m45.0s

running (3m22.0s), 150/150 VUs, 34672 complete and 0 interrupted iterations
default   [  71% ] 150/150 VUs  3m22.0s/4m45.0s

running (3m23.0s), 150/150 VUs, 34895 complete and 0 interrupted iterations
default   [  71% ] 150/150 VUs  3m23.0s/4m45.0s

running (3m24.0s), 150/150 VUs, 35129 complete and 0 interrupted iterations
default   [  72% ] 150/150 VUs  3m24.0s/4m45.0s

running (3m25.0s), 150/150 VUs, 35360 complete and 0 interrupted iterations
default   [  72% ] 150/150 VUs  3m25.0s/4m45.0s

running (3m26.0s), 150/150 VUs, 35577 complete and 0 interrupted iterations
default   [  72% ] 150/150 VUs  3m26.0s/4m45.0s

running (3m27.0s), 150/150 VUs, 35808 complete and 0 interrupted iterations
default   [  73% ] 150/150 VUs  3m27.0s/4m45.0s

running (3m28.0s), 150/150 VUs, 36039 complete and 0 interrupted iterations
default   [  73% ] 150/150 VUs  3m28.0s/4m45.0s

running (3m29.0s), 150/150 VUs, 36265 complete and 0 interrupted iterations
default   [  73% ] 150/150 VUs  3m29.0s/4m45.0s

running (3m30.0s), 150/150 VUs, 36501 complete and 0 interrupted iterations
default   [  74% ] 150/150 VUs  3m30.0s/4m45.0s

running (3m31.0s), 150/150 VUs, 36741 complete and 0 interrupted iterations
default   [  74% ] 150/150 VUs  3m31.0s/4m45.0s

running (3m32.0s), 150/150 VUs, 36963 complete and 0 interrupted iterations
default   [  74% ] 150/150 VUs  3m32.0s/4m45.0s

running (3m33.0s), 150/150 VUs, 37215 complete and 0 interrupted iterations
default   [  75% ] 150/150 VUs  3m33.0s/4m45.0s

running (3m34.0s), 150/150 VUs, 37448 complete and 0 interrupted iterations
default   [  75% ] 150/150 VUs  3m34.0s/4m45.0s

running (3m35.0s), 150/150 VUs, 37686 complete and 0 interrupted iterations
default   [  75% ] 150/150 VUs  3m35.0s/4m45.0s

running (3m36.0s), 150/150 VUs, 37912 complete and 0 interrupted iterations
default   [  76% ] 150/150 VUs  3m36.0s/4m45.0s

running (3m37.0s), 150/150 VUs, 38141 complete and 0 interrupted iterations
default   [  76% ] 150/150 VUs  3m37.0s/4m45.0s

running (3m38.0s), 150/150 VUs, 38384 complete and 0 interrupted iterations
default   [  76% ] 150/150 VUs  3m38.0s/4m45.0s

running (3m39.0s), 150/150 VUs, 38623 complete and 0 interrupted iterations
default   [  77% ] 150/150 VUs  3m39.0s/4m45.0s

running (3m40.0s), 150/150 VUs, 38863 complete and 0 interrupted iterations
default   [  77% ] 150/150 VUs  3m40.0s/4m45.0s

running (3m41.0s), 150/150 VUs, 39069 complete and 0 interrupted iterations
default   [  78% ] 150/150 VUs  3m41.0s/4m45.0s

running (3m42.0s), 150/150 VUs, 39288 complete and 0 interrupted iterations
default   [  78% ] 150/150 VUs  3m42.0s/4m45.0s

running (3m43.0s), 150/150 VUs, 39529 complete and 0 interrupted iterations
default   [  78% ] 150/150 VUs  3m43.0s/4m45.0s

running (3m44.0s), 150/150 VUs, 39771 complete and 0 interrupted iterations
default   [  79% ] 150/150 VUs  3m44.0s/4m45.0s

running (3m45.0s), 150/150 VUs, 40008 complete and 0 interrupted iterations
default   [  79% ] 150/150 VUs  3m45.0s/4m45.0s

running (3m46.0s), 150/150 VUs, 40200 complete and 0 interrupted iterations
default   [  79% ] 150/150 VUs  3m46.0s/4m45.0s

running (3m47.0s), 150/150 VUs, 40315 complete and 0 interrupted iterations
default   [  80% ] 150/150 VUs  3m47.0s/4m45.0s

running (3m48.0s), 150/150 VUs, 40495 complete and 0 interrupted iterations
default   [  80% ] 150/150 VUs  3m48.0s/4m45.0s

running (3m49.0s), 150/150 VUs, 40712 complete and 0 interrupted iterations
default   [  80% ] 150/150 VUs  3m49.0s/4m45.0s

running (3m50.0s), 150/150 VUs, 40949 complete and 0 interrupted iterations
default   [  81% ] 150/150 VUs  3m50.0s/4m45.0s

running (3m51.0s), 150/150 VUs, 41172 complete and 0 interrupted iterations
default   [  81% ] 150/150 VUs  3m51.0s/4m45.0s

running (3m52.0s), 150/150 VUs, 41396 complete and 0 interrupted iterations
default   [  81% ] 150/150 VUs  3m52.0s/4m45.0s

running (3m53.0s), 150/150 VUs, 41616 complete and 0 interrupted iterations
default   [  82% ] 150/150 VUs  3m53.0s/4m45.0s

running (3m54.0s), 150/150 VUs, 41836 complete and 0 interrupted iterations
default   [  82% ] 150/150 VUs  3m54.0s/4m45.0s

running (3m55.0s), 150/150 VUs, 42061 complete and 0 interrupted iterations
default   [  82% ] 150/150 VUs  3m55.0s/4m45.0s

running (3m56.0s), 150/150 VUs, 42294 complete and 0 interrupted iterations
default   [  83% ] 150/150 VUs  3m56.0s/4m45.0s

running (3m57.0s), 150/150 VUs, 42507 complete and 0 interrupted iterations
default   [  83% ] 150/150 VUs  3m57.0s/4m45.0s

running (3m58.0s), 150/150 VUs, 42713 complete and 0 interrupted iterations
default   [  83% ] 150/150 VUs  3m58.0s/4m45.0s

running (3m59.0s), 150/150 VUs, 42930 complete and 0 interrupted iterations
default   [  84% ] 150/150 VUs  3m59.0s/4m45.0s

running (4m00.0s), 150/150 VUs, 43164 complete and 0 interrupted iterations
default   [  84% ] 150/150 VUs  4m00.0s/4m45.0s

running (4m01.0s), 148/150 VUs, 43383 complete and 0 interrupted iterations
default   [  85% ] 148/150 VUs  4m01.0s/4m45.0s

running (4m02.0s), 145/150 VUs, 43600 complete and 0 interrupted iterations
default   [  85% ] 145/150 VUs  4m02.0s/4m45.0s

running (4m03.0s), 143/150 VUs, 43809 complete and 0 interrupted iterations
default   [  85% ] 143/150 VUs  4m03.0s/4m45.0s

running (4m04.0s), 138/150 VUs, 44052 complete and 0 interrupted iterations
default   [  86% ] 138/150 VUs  4m04.0s/4m45.0s

running (4m05.0s), 134/150 VUs, 44279 complete and 0 interrupted iterations
default   [  86% ] 134/150 VUs  4m05.0s/4m45.0s

running (4m06.0s), 131/150 VUs, 44512 complete and 0 interrupted iterations
default   [  86% ] 131/150 VUs  4m06.0s/4m45.0s

running (4m07.0s), 129/150 VUs, 44748 complete and 0 interrupted iterations
default   [  87% ] 129/150 VUs  4m07.0s/4m45.0s

running (4m08.0s), 126/150 VUs, 44962 complete and 0 interrupted iterations
default   [  87% ] 126/150 VUs  4m08.0s/4m45.0s

running (4m09.0s), 121/150 VUs, 45182 complete and 0 interrupted iterations
default   [  87% ] 121/150 VUs  4m09.0s/4m45.0s

running (4m10.0s), 120/150 VUs, 45343 complete and 0 interrupted iterations
default   [  88% ] 120/150 VUs  4m10.0s/4m45.0s

running (4m11.0s), 115/150 VUs, 45560 complete and 0 interrupted iterations
default   [  88% ] 115/150 VUs  4m11.0s/4m45.0s

running (4m12.0s), 111/150 VUs, 45761 complete and 0 interrupted iterations
default   [  88% ] 111/150 VUs  4m12.0s/4m45.0s

running (4m13.0s), 107/150 VUs, 45958 complete and 0 interrupted iterations
default   [  89% ] 107/150 VUs  4m13.0s/4m45.0s

running (4m14.0s), 104/150 VUs, 46147 complete and 0 interrupted iterations
default   [  89% ] 104/150 VUs  4m14.0s/4m45.0s

running (4m15.0s), 101/150 VUs, 46322 complete and 0 interrupted iterations
default   [  89% ] 101/150 VUs  4m15.0s/4m45.0s

running (4m16.0s), 099/150 VUs, 46516 complete and 0 interrupted iterations
default   [  90% ] 099/150 VUs  4m16.0s/4m45.0s

running (4m17.0s), 095/150 VUs, 46691 complete and 0 interrupted iterations
default   [  90% ] 095/150 VUs  4m17.0s/4m45.0s

running (4m18.0s), 092/150 VUs, 46858 complete and 0 interrupted iterations
default   [  91% ] 092/150 VUs  4m18.0s/4m45.0s

running (4m19.0s), 089/150 VUs, 47025 complete and 0 interrupted iterations
default   [  91% ] 089/150 VUs  4m19.0s/4m45.0s

running (4m20.0s), 085/150 VUs, 47193 complete and 0 interrupted iterations
default   [  91% ] 085/150 VUs  4m20.0s/4m45.0s

running (4m21.0s), 082/150 VUs, 47337 complete and 0 interrupted iterations
default   [  92% ] 082/150 VUs  4m21.0s/4m45.0s

running (4m22.0s), 078/150 VUs, 47496 complete and 0 interrupted iterations
default   [  92% ] 078/150 VUs  4m22.0s/4m45.0s

running (4m23.0s), 075/150 VUs, 47642 complete and 0 interrupted iterations
default   [  92% ] 075/150 VUs  4m23.0s/4m45.0s

running (4m24.0s), 071/150 VUs, 47785 complete and 0 interrupted iterations
default   [  93% ] 071/150 VUs  4m24.0s/4m45.0s

running (4m25.0s), 069/150 VUs, 47918 complete and 0 interrupted iterations
default   [  93% ] 069/150 VUs  4m25.0s/4m45.0s

running (4m26.0s), 064/150 VUs, 48041 complete and 0 interrupted iterations
default   [  93% ] 064/150 VUs  4m26.0s/4m45.0s

running (4m27.0s), 062/150 VUs, 48160 complete and 0 interrupted iterations
default   [  94% ] 062/150 VUs  4m27.0s/4m45.0s

running (4m28.0s), 057/150 VUs, 48274 complete and 0 interrupted iterations
default   [  94% ] 057/150 VUs  4m28.0s/4m45.0s

running (4m29.0s), 054/150 VUs, 48382 complete and 0 interrupted iterations
default   [  94% ] 054/150 VUs  4m29.0s/4m45.0s

running (4m30.0s), 051/150 VUs, 48486 complete and 0 interrupted iterations
default   [  95% ] 051/150 VUs  4m30.0s/4m45.0s

running (4m31.0s), 049/150 VUs, 48578 complete and 0 interrupted iterations
default   [  95% ] 049/150 VUs  4m31.0s/4m45.0s

running (4m32.0s), 045/150 VUs, 48673 complete and 0 interrupted iterations
default   [  95% ] 045/150 VUs  4m32.0s/4m45.0s

running (4m33.0s), 042/150 VUs, 48748 complete and 0 interrupted iterations
default   [  96% ] 042/150 VUs  4m33.0s/4m45.0s

running (4m34.0s), 038/150 VUs, 48827 complete and 0 interrupted iterations
default   [  96% ] 038/150 VUs  4m34.0s/4m45.0s

running (4m35.0s), 035/150 VUs, 48902 complete and 0 interrupted iterations
default   [  96% ] 035/150 VUs  4m35.0s/4m45.0s

running (4m36.0s), 031/150 VUs, 48965 complete and 0 interrupted iterations
default   [  97% ] 031/150 VUs  4m36.0s/4m45.0s

running (4m37.0s), 029/150 VUs, 49022 complete and 0 interrupted iterations
default   [  97% ] 029/150 VUs  4m37.0s/4m45.0s

running (4m38.0s), 025/150 VUs, 49077 complete and 0 interrupted iterations
default   [  98% ] 025/150 VUs  4m38.0s/4m45.0s

running (4m39.0s), 022/150 VUs, 49107 complete and 0 interrupted iterations
default   [  98% ] 022/150 VUs  4m39.0s/4m45.0s

running (4m40.0s), 019/150 VUs, 49149 complete and 0 interrupted iterations
default   [  98% ] 019/150 VUs  4m40.0s/4m45.0s

running (4m41.0s), 015/150 VUs, 49185 complete and 0 interrupted iterations
default   [  99% ] 015/150 VUs  4m41.0s/4m45.0s

running (4m42.0s), 011/150 VUs, 49212 complete and 0 interrupted iterations
default   [  99% ] 011/150 VUs  4m42.0s/4m45.0s

running (4m43.0s), 007/150 VUs, 49230 complete and 0 interrupted iterations
default   [  99% ] 007/150 VUs  4m43.0s/4m45.0s

running (4m44.0s), 006/150 VUs, 49240 complete and 0 interrupted iterations
default   [ 100% ] 006/150 VUs  4m44.0s/4m45.0s

running (4m45.0s), 002/150 VUs, 49250 complete and 0 interrupted iterations
default   [ 100% ] 002/150 VUs  4m45.0s/4m45.0s


  █ TOTAL RESULTS 

    checks_total.......: 98504   345.485393/s
    checks_succeeded...: 100.00% 98504 out of 98504
    checks_failed......: 0.00%   0 out of 98504

    ✓ login 200
    ✓ login contains form

    HTTP
    http_req_duration..............: avg=84.99ms min=16.02ms  med=53.78ms  max=1.48s p(90)=177.37ms p(95)=211.9ms 
      { expected_response:true }...: avg=84.99ms min=16.02ms  med=53.78ms  max=1.48s p(90)=177.37ms p(95)=211.9ms 
    http_req_failed................: 0.00%  0 out of 49252
    http_reqs......................: 49252  172.742697/s

    EXECUTION
    iteration_duration.............: avg=586ms   min=516.81ms med=554.88ms max=1.98s p(90)=678.26ms p(95)=712.93ms
    iterations.....................: 49252  172.742697/s
    vus............................: 2      min=2          max=150
    vus_max........................: 150    min=150        max=150

    NETWORK
    data_received..................: 447 MB 1.6 MB/s
    data_sent......................: 5.1 MB 18 kB/s



running (4m45.1s), 000/150 VUs, 49252 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/150 VUs  4m45s